{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "sg_mkldnn_fully_connected_relu_0", 
      "attrs": {"with_relu": "True"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "flatten0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc1_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc1", 
              "attrs": {"num_hidden": "128"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "relu1", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attrs": {"num_hidden": "64"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attrs": {"num_hidden": "64"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "sg_mkldnn_fully_connected_relu_1", 
      "attrs": {"with_relu": "True"}, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_fully_connected_relu_0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc2_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc2_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc2", 
              "attrs": {"num_hidden": "64"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "relu2", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "sg_mkldnn_fully_connected_2", 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_fully_connected_relu_1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc3_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc3_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc3", 
              "attrs": {"num_hidden": "10"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4], 
          "heads": [[3, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 3, 5, 6, 8, 9, 11], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13
  ], 
  "heads": [[12, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}