{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "data_quantize", 
      "attrs": {
        "max_calib_range": "0.999994", 
        "min_calib_range": "-1.000000", 
        "out_type": "auto"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_flatten", 
      "name": "quantized_flatten0", 
      "inputs": [[1, 0, 0], [1, 1, 0], [1, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_relu_0", 
      "attrs": {
        "max_calib_range": "6.550594", 
        "min_calib_range": "-0.000000", 
        "quantized": "True", 
        "with_relu": "True"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [2, 1, 0], [2, 2, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "flatten0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc1_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc1", 
              "attrs": {"num_hidden": "128"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "relu1", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_relu_1", 
      "attrs": {
        "max_calib_range": "7.548761", 
        "min_calib_range": "-0.000000", 
        "quantized": "True", 
        "with_relu": "True"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [9, 1, 0], [9, 2, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_fully_connected_relu_0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc2_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc2_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc2", 
              "attrs": {"num_hidden": "64"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "relu2", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_2", 
      "attrs": {
        "enable_float_output": "True", 
        "quantized": "True"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [16, 1, 0], [16, 2, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_fully_connected_relu_1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc3_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc3_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc3", 
              "attrs": {"num_hidden": "10"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4], 
          "heads": [[3, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    24
  ], 
  "node_row_ptr": [
    0, 
    1, 
    4, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34
  ], 
  "heads": [[25, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}